# read design
read_verilog contador.v
hierarchy -check -top contador16
# the high-level stuff
proc; opt; fsm; opt; memory; opt
# mapping to internal cell library
techmap; opt
# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib
# mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib
# cleanup
clean
# show
show -lib cmos_cells.v
# write synsthesized design
write_verilog contador_cmos_no_delay.v
